int/resources/objectRepo/xmlTemplates/ows/OWSReservationAdvanced/req_FetchQueueReservations.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://webservices.micros.com/og/4.3/Common/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:hot="http://webservices.micros.com/og/4.3/HotelCommon/" xmlns:name="http://webservices.micros.com/og/4.3/Name/" xmlns:res="http://webservices.micros.com/og/4.3/ResvAdvanced/">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="true" primaryLangID="E" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <res:FetchQueueReservationsRequest>
         <res:Guests birthDate="?" gender="?" profileType="?">
            <name:PersonName active="?" familiarName="?" nameOrdered="?">
               <com:nameTitle/>
               <com:firstName/>
               <com:middleName/>
               <com:lastName/>
               <com:nameSuffix/>
               <com:accountName2/>
               <com:accountName3/>
               <com:profession/>
            </name:PersonName>
            <name:NativeName active="?" familiarName="?" languageCode="?" nameOrdered="?">
               <com:nameTitle/>
               <com:firstName/>
               <com:middleName/>
               <com:lastName/>
               <com:nameSuffix/>
               <com:accountName2/>
               <com:accountName3/>
               <com:profession/>
            </name:NativeName>
            <name:BusinessTitle/>
            <name:GovernmentIDList>
               <com:GovernmentID countryOfIssue="?" displaySequence="?" documentID="?" documentNumber="?" documentType="?" effectiveDate="?" expirationDate="?" placeOfIssue="?" primary="?" resort="?"/>
            </name:GovernmentIDList>
         </res:Guests>
         <res:RoomStay effectiveDate="?" expirationDate="?" feature="?" invBlockCode="?" isRoom="?" minimumRoomsAvailable="?" numberOfUnits="?" pseudoRoom="?" roomClass="?" roomServiceStatus="?" roomStatus="?" roomToChargeCode="?" roomToChargeName="?" roomTypeCode="?" roomTypeName="?" upgradeFromCode="?">
            <hot:RoomTypeDescription>
               <hot:Text formatted="?" language="?"/>
               <hot:Image/>
               <hot:URL/>
            </hot:RoomTypeDescription>
            <hot:RoomTypeShortDescription>
               <hot:Text formatted="?" language="?"/>
               <hot:Image/>
               <hot:URL/>
            </hot:RoomTypeShortDescription>
            <hot:RoomNumber/>
            <hot:RoomToChargeDescription>
               <hot:Text formatted="?" language="?"/>
               <hot:Image/>
               <hot:URL/>
            </hot:RoomToChargeDescription>
            <hot:RoomToChargeShortDescription>
               <hot:Text formatted="?" language="?"/>
               <hot:Image/>
               <hot:URL/>
            </hot:RoomToChargeShortDescription>
            <hot:AmenityInfo>
               <hot:Amenities>
                  <hot:Amenity amenityCode="?" amenityType="?" availabilityFlag="?" otherFlag="?" otherType="?">
                     <hot:amenityDescription/>
                  </hot:Amenity>
               </hot:Amenities>
            </hot:AmenityInfo>
            <hot:RoomFeatures>
               <hot:Features AttachPreferenceToProfile="?" Description="?" Feature="?">
                  <hot:FeatureID/>
               </hot:Features>
            </hot:RoomFeatures>
         </res:RoomStay>
         <res:HotelReference chainCode="?" hotelCode="?"/>
      </res:FetchQueueReservationsRequest>
   </soapenv:Body>
</soapenv:Envelope>